<?php

return [
    'cart' => [
        'product' => [
            'not_found' => 'هذا المنتج غير متاح حالياً, رقم:',
        ],
    ],
    'validations' => [
        'cart' => [
            'vendor_not_match' => 'هذا المنتج غير متطابق مع منتجات المتجر الاخر ، من فضلك احذف السلة و حاول مره اخرى',
        ],
        'user_token' => [
            'required' => 'ادخل رقم المستخدم',
        ],
        'state_id' => [
            'required' => 'ادخل رقم المنطقة',
            'exists' => 'رقم المنطقة غير موجود',
        ],
        'address_id' => [
            'required' => 'ادخل رقم العنوان',
            'exists' => 'رقم العنوان غير موجود',
        ],
    ],
];
